interThermalPhaseFoam/BubblySGS/BubblySGS_500/0/pc
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

 BotWall
    {
 		type            zeroGradient;
    }    

    FreeStream
    {
 		type            zeroGradient;
    }

    FrontNBack
    {
        type            empty;
    }

	LeftSide
	{
		type            symmetryPlane;
	}

	RightSide
	{
		type            symmetryPlane;
	}

}


// ************************************************************************* //
